Afina_desktop/src/InformationRegisters/ОчередьЗадач/ОчередьЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВыполненияЗадач</types>
    </type>
  </resources>
  <resources>
    <name>РезультатПроверки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Afina_desktop/src/InformationRegisters/РезультатыПроверкиЗадач/РезультатыПроверкиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыПроверкиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>EnumRef.Результат</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторРешения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Afina_desktop/src/Enums/Результат/Результат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Результат</name>
  <enumValues>
    <name>Зачтено</name>
  </enumValues>
  <enumValues>
    <name>НеЗачтено</name>
  </enumValues>
</mdclass:Enum>

Afina_desktop/src/CommonModules/ОбработкаРезультатовТестированияСервер/Module.bsl
Процедура РасчтатьРезультатВыполнения(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьЗадач.Пользователь КАК Пользователь,
		|	ОчередьЗадач.Задача КАК Задача,
		|	ОчередьЗадач.РезультатПроверки КАК РезультатПроверки
		|ИЗ
		|	РегистрСведений.ОчередьЗадач КАК ОчередьЗадач
		|ГДЕ
		|	ОчередьЗадач.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Новый УникальныйИдентификатор(Идентификатор));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РезультатПроверкиСтруктура = ОбменДаннымиСервер.ПолучитьСтруктуруИзJSON(Выборка.РезультатПроверки);		
		РезультатПроверкиСтруктура.Вставить("Пользователь", Выборка.Пользователь);
		РезультатПроверкиСтруктура.Вставить("Задача", Выборка.Задача);
		СоздатьЗаписьСРезультатомПроверки(Идентификатор, РезультатПроверкиСтруктура);
		
	КонецЕсли;
	

КонецПроцедуры


Процедура СоздатьЗаписьСРезультатомПроверки(Идентификатор, РезультатПроверкиСтруктура)

	ЗаписьРегистра = РегистрыСведений.РезультатыПроверкиЗадач.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Период = ТекущаяДата();
	ЗаписьРегистра.ИдентификаторРешения = Новый УникальныйИдентификатор(Идентификатор);
	ЗаписьРегистра.Пользователь = РезультатПроверкиСтруктура.Пользователь;
	ЗаписьРегистра.Задача = РезультатПроверкиСтруктура.Задача;
	ЗаписьРегистра.КоличествоБаллов = РезультатПроверкиСтруктура.result;
	ЗаписьРегистра.СтатусВыполнения = ВычислитьСтатусВыполнения(РезультатПроверкиСтруктура.Задача, РезультатПроверкиСтруктура.result);
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

Функция ВычислитьСтатусВыполнения(Задача, КоличествоБаллов)

	Если Задача.ПроходнойБаллДляВыполнения <= КоличествоБаллов Тогда
		
		Возврат Перечисления.Результат.Зачтено;
		
	Иначе
		
		Возврат Перечисления.Результат.НеЗачтено;
	
	КонецЕсли;	

КонецФункции // ВычислитьСтатусВыполнения()
